[
  {
    "id": "01",
    "title":"Printer broken",
    "issuePreview":"Printer broken",
    "issue":"Windows is sending print jobs to the wrong printer",
    "solution":"For some mysterious reason, Windows may select a new default printer--the one it automatically sends print jobs to. (This happened to me when I upgraded from Vista to Windows 7.) To fix this glitch in Windows 7, click Start (the Windows icon in the lower-left corner of the screen) and select Devices and Printers. Under Printers and Faxes, right-click the printer you want to make the default, and select Set as default printer.",
    "product":"Printer",
    "customerId":"12",
    "resolved":false,
    "authorId":"05",
    "relatedArticles":["01","02","03","04","05"]
  },
  {
    "id": "02",
    "title":"Short circuiting",
    "issuePreview":"Short Circuiting",
    "issue":"Up until last night the system has been very stable with the processor idling at 30 degrees and maxing at 40 degrees. However, the machine hanged mid-game in Crysis 2 at full graphics. I manged to get to Windows 7 desktop but could not power down the machine in software, so I resorted to switching it off via PSU and thought nothing of it at the time. I went to switch on the computer around 20 hours later and it would not power up.",
    "solution":"do you smell the 'burnt electronics smell' its very distinctive. you can take parts out and give them a sniff, might help if you already know the smell. its a smell you never forget its like death of electronics. You test you psu, i am sure there is a youtube video, i would do that really quick first as you can probably rule that out fast with a multimeter. after testing your ram and that isnt what is wrong then you probably have a defunct motherboard. test the graphics card too just to be sure [doesnt hurt to be thorough]. typically processors are alright if you have a bad motherboard, so you should be safe. its probably your mother board",
    "authodId":"04",
    "product":"Computer",
    "customerId":"14",
    "resolved":true,
    "relatedArticles":["01","02","03","04","05"]
  },
  {
    "id": "03",
    "title":"overheating",
    "issuePreview":"Overheating",
    "issue":"My computer keeps overheating. What causes this and how can I fix it?",
    "solution":"The first and most important thing you need to do when your laptop is overheating, is to clean the fan/s that provide/s cooling to the CPU and graphics card. Over time they build up layers of dust and dirt that slow them down and block flow of air. Consult your laptop’s manual or manufacturer to find out how you can open the laptop to access and clean these parts. Carefully clean the fan/s with a cotton swab dipped in a drop of alcohol. Make sure the alcohol has completely evaporated before you reconnect the laptop to the power. You can also use a vacuum cleaner to remove the dust and dirt that clocks up the fan/s. To prevent damage to the fan, do not let it revolve in the wrong direction. If you want to use canned air to clean the fan, arrest the fan by holding it down. Next, you can clean the exhaust port by sucking out air with a vacuum cleaner. The exhaust port usually sits on the side of the laptop. It’s the opening that blows out hot air.The intake grills are small openings that allow air to be sucked into the laptop by the revolving fans. They can sit on the sides or at the bottom of your notebook. To clear the intake grills, spray them with canned air.",
    "authorId":"02",
    "product":"Computer",
    "customerId":"9",
    "resolved":true,
    "relatedArticles":["01","02","03","04","05"]
  },
  {
    "id": "04",
    "title":"blue screen of death",
    "issuePreview":"Blue screen o death",
    "issue":" keep getting a “blue screen of death” and the following error message: PAGE_FAULT_IN_NONPAGED_AREA and a bunch of other lines and the computer locks up. What is causing this and how can I fix it? ",
    "solution":"Unfortunately, with only that to go on, there are hundreds, if not thousands, of possible answers. To really diagnose, we’d need a lot more information about the system it’s happening on, the software and hardware installed, and what was happening at the time the problem happened. I’ll throw out some guidelines, so perhaps you can narrow down the diagnosis. While the hardware can sometimes be bad, the real culprit is typically outdated, or just buggy, drivers. If you’ve just installed new hardware, then it’s likely to be related to the problem. Make sure you’re running the latest drivers for that device. Check Windows Update, specifically for “Optional” updates, as driver updates are often classified as optional. Check with your computer manufacturer’s support site, or the support site for the specific hardware you recently added to your computer, for specific driver information as well. Conversely, if you’ve just updated drivers, that would also be something to be very suspicious of.  See How, and when, should I update drivers? for more information on driver updates. (Spoiler: don’t use driver update utilities.) It’s rare these days, but occasionally software can cause blue screens as well. If you’ve just installed new software, I’d be very tempted to immediately uninstall it and see if the problem goes away. I’d also make sure that Windows is as up-to-date as possible, once again by visiting Windows Update to check for both “important” and “optional” updates.",
    "authorId":"03",
    "product":"Computer",
    "customerId":"56",
    "resolved":false,
    "relatedArticles":["01","02","03","04","05"]
  },
  {
    "id": "05",
    "title":"not enough free cookies",
    "issuePreview":"Not enough free cookies",
    "issue":"This weekend I made 2 batches of chocolate chip cookies from 2 different recipes. I made the 'Perfect' CC cookies from CI. They weren't my absolute favorite, but they came out looking and tasting like proper cookies. Then I made the Chocolate Chip Rye Cookies from this recipe (about 1/3 of the way down the page): I'm guessing that the use of cake flour was to balance the protein level of the rye flour and for that reason I was very hesitant to tinker with the flours before trying the recipe as written. Is this a case of a professional recipe not translating to home use or perhaps a professional baker withholding some useful information?",
    "solution":"Whoa, that's a lot of butter. 3 sticks for 2 dozen cookies? Those don't even look like big cookies. Although, it's 2+ cups of flour. They sound delicious though. I think what I would do is to roll the dough into logs and then refrigerate overnight. Then slice and bake them. I suspect your butter was really warm and then worked over with all the separate additions. Could you taste the rye flavor? The reason they spread like that is because of the fat content. More fat = thinner cookie. Less fat = thicker cookie. The normal ratio (BY WEIGHT!!!) for a cookie is 1 part sugar, 2 parts fat, 3 parts flour. That will give you a normal crumbly semi-dry cookie. I'm pretty sure there's a typo in the recipe. I'd try with 2 sticks of butter instead of 3",
    "product":"Humans",
    "authorId":"01",
    "customerId":"34",
    "resolved":true,
    "relatedArticles":["01","02","03","04","05"]
  }
]
